<a href="https://colab.research.google.com/github/agaevusal/ec_retail_task/blob/main/sdvor_test.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [55]:
from google.colab import drive
import pandas as pd
import numpy as np
import math as m

In [56]:
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [57]:
copied_path = '/content/drive/MyDrive/Colab_notebooks/datasets_for_ml/test_orders_info.csv'

In [58]:

data = pd.read_csv(copied_path, sep = ';')

In [59]:
data.head()

   order_date   org    order_id    material  inv_qty        rev
0    20190801  1000  1009650752  3300030000    720.0   28080.00
1    20190801  1000  1009650752  7200859000      1.0    5037.00
2    20190801  1000  1009862550  7200859000      0.0   -2000.00
3    20190801  1000  1009924088  1500226000    864.0  165507.84
4    20190801  1000  1009924088  7200859000      2.0   24000.00

In [60]:
data.shape

(6051891, 6)

In [61]:
data.columns

Index(['order_date', 'org', 'order_id', 'material', 'inv_qty', 'rev'], dtype='object')

In [62]:
data['order_date'] = pd.to_datetime(data.order_date.astype(str), format='%Y%m%d')

In [63]:
data.dtypes

order_date    datetime64[ns]
org                    int64
order_id               int64
material               int64
inv_qty              float64
rev                  float64
dtype: object

In [64]:
data.describe()

                org      order_id      material       inv_qty           rev
count  6.051891e+06  6.051891e+06  6.051891e+06  6.051891e+06  6.051891e+06
mean   1.630195e+03  2.033077e+09  3.463418e+09  7.571628e+00  6.431352e+02
std    9.706993e+02  1.920339e+07  2.416476e+09  9.771688e+01  3.418305e+03
min    1.000000e+03  1.008984e+09  2.000000e+04 -6.120000e+03 -2.375172e+05
25%    1.000000e+03  2.032632e+09  1.000644e+09  1.000000e+00  6.030000e+01
50%    1.000000e+03  2.033448e+09  3.400913e+09  1.000000e+00  1.500000e+02
75%    2.000000e+03  2.034244e+09  5.500865e+09  2.000000e+00  3.800000e+02
max    7.000000e+03  2.035019e+09  9.900999e+09  4.060800e+04  1.508000e+06

In [65]:
data.isnull().sum()

order_date    0
org           0
order_id      0
material      0
inv_qty       0
rev           0
dtype: int64

In [66]:
data = data.query('rev > 0  & inv_qty > 0')

In [67]:
data.shape

(6032378, 6)

In [68]:
data.describe()

                org      order_id      material       inv_qty           rev
count  6.032378e+06  6.032378e+06  6.032378e+06  6.032378e+06  6.032378e+06
mean   1.626711e+03  2.033129e+09  3.456216e+09  7.587956e+00  6.454515e+02
std    9.639099e+02  1.779196e+07  2.413699e+09  9.782478e+01  3.420193e+03
min    1.000000e+03  1.008984e+09  2.000000e+04  1.000000e-03  1.000000e-02
25%    1.000000e+03  2.032633e+09  1.000533e+09  1.000000e+00  6.120000e+01
50%    1.000000e+03  2.033448e+09  3.400913e+09  1.000000e+00  1.500000e+02
75%    2.000000e+03  2.034244e+09  5.500769e+09  2.000000e+00  3.825000e+02
max    7.000000e+03  2.035019e+09  9.900999e+09  4.060800e+04  1.508000e+06

In [69]:
data.org.unique()

array([1000, 2000, 3000, 4001, 7000])

In [70]:
data.head()

  order_date   org    order_id    material  inv_qty        rev
0 2019-08-01  1000  1009650752  3300030000    720.0   28080.00
1 2019-08-01  1000  1009650752  7200859000      1.0    5037.00
3 2019-08-01  1000  1009924088  1500226000    864.0  165507.84
4 2019-08-01  1000  1009924088  7200859000      2.0   24000.00
5 2019-08-01  1000  1009929088   800129000    312.0    8149.44

In [71]:
data.shape

(6032378, 6)

In [72]:
data['inv_qty'] = data['inv_qty'].apply(m.ceil)

In [73]:
data['price'] = data['rev'] / data['inv_qty']

In [74]:
data = data.drop(['rev','inv_qty','order_date'],axis = 1)

In [75]:
data.head()

    org    order_id    material     price
0  1000  1009650752  3300030000     39.00
1  1000  1009650752  7200859000   5037.00
3  1000  1009924088  1500226000    191.56
4  1000  1009924088  7200859000  12000.00
5  1000  1009929088   800129000     26.12

In [76]:
data.shape

(6032378, 4)

In [77]:
anchors = data.rename(columns = {'org':'city','material':'anchor'})

In [78]:
anchors.head()

   city    order_id      anchor     price
0  1000  1009650752  3300030000     39.00
1  1000  1009650752  7200859000   5037.00
3  1000  1009924088  1500226000    191.56
4  1000  1009924088  7200859000  12000.00
5  1000  1009929088   800129000     26.12

In [79]:
anchors = anchors.sort_values(['order_id','price'], ascending=[True,False], ignore_index=True)\
                                  .groupby(['order_id'])\
                                  .head(1)\
                                  .reset_index(drop=True)

In [80]:
anchors

         city    order_id      anchor     price
0        1000  1008984447   800134000     19.20
1        1000  1008992198  8700605001     25.00
2        1000  1009641513  7200859000  27000.00
3        1000  1009650752  7200859000   5037.00
4        1000  1009678287  7200859000   4550.00
...       ...         ...         ...       ...
2314502  1000  2035018895  2700760001    447.00
2314503  2000  2035018902  5500575000    314.16
2314504  1000  2035018904  1700973003    250.00
2314505  1000  2035018952  1300268000    443.70
2314506  2000  2035018963  2100828000    514.98

[2314507 rows x 4 columns]

In [81]:
anchors[anchors.order_id == 1009650752] #chek up

   city    order_id      anchor   price
3  1000  1009650752  7200859000  5037.0

In [82]:
anchors[anchors.order_id == 2035018963 ] # chek up

         city    order_id      anchor   price
2314506  2000  2035018963  2100828000  514.98

In [83]:
data.head()

    org    order_id    material     price
0  1000  1009650752  3300030000     39.00
1  1000  1009650752  7200859000   5037.00
3  1000  1009924088  1500226000    191.56
4  1000  1009924088  7200859000  12000.00
5  1000  1009929088   800129000     26.12

In [84]:
secondaries = data.rename(columns = {'org':'city','material':'secondaries'})

In [85]:
secondaries = secondaries.sort_values(['order_id','price'], ascending = [True,True]).reset_index(drop = True)

In [86]:
secondaries

         city    order_id  secondaries   price
0        1000  1008984447    700831000   18.20
1        1000  1008984447    800134000   19.20
2        1000  1008992198   8700579001   17.50
3        1000  1008992198   8700605001   25.00
4        1000  1009641513   3700017000   98.80
...       ...         ...          ...     ...
6032373  1000  2035018904   1700973003  250.00
6032374  1000  2035018952   1300268000  443.70
6032375  2000  2035018963    900296001   23.14
6032376  2000  2035018963    900297001   36.49
6032377  2000  2035018963   2100828000  514.98

[6032378 rows x 4 columns]

In [87]:
secondaries[secondaries.order_id == 2035018963]

         city    order_id  secondaries   price
6032375  2000  2035018963    900296001   23.14
6032376  2000  2035018963    900297001   36.49
6032377  2000  2035018963   2100828000  514.98

In [88]:
data[data.order_id == 2035018963]

          org    order_id    material   price
6046184  2000  2035018963  2100828000  514.98
6046185  2000  2035018963   900296001   23.14
6046186  2000  2035018963   900297001   36.49

In [89]:
#secondaries = secondaries.groupby('order_id').shift(periods = 1)\
                                   # .dropna()\
                                   # .reset_index(drop = True)

In [90]:
#secondaries.head()

In [91]:
shifted_df = secondaries.groupby('order_id').shift(1)\
                            .assign(order_id = secondaries['order_id'])\
                            .dropna()\
                            .reset_index(drop = True)

In [92]:
#shifted_df = shifted_df.assign(order_id = secondaries['order_id'])

In [93]:
#shifted_df = shifted_df.dropna()

In [94]:
shifted_df.head()

     city   secondaries  price    order_id
0  1000.0  7.008310e+08   18.2  1008984447
1  1000.0  8.700579e+09   17.5  1008992198
2  1000.0  3.700017e+09   98.8  1009641513
3  1000.0  3.300030e+09   39.0  1009650752
4  1000.0  2.100101e+09    4.0  1009678287

In [95]:
shifted_df['city'] = shifted_df['city'].astype(int)

In [96]:
shifted_df['secondaries'] = shifted_df['secondaries'].astype(int)

In [97]:
shifted_df.head()

   city  secondaries  price    order_id
0  1000    700831000   18.2  1008984447
1  1000   8700579001   17.5  1008992198
2  1000   3700017000   98.8  1009641513
3  1000   3300030000   39.0  1009650752
4  1000   2100101000    4.0  1009678287

In [98]:
secondaries[secondaries.order_id == 2035018904] ##check up

         city    order_id  secondaries  price
6032371  1000  2035018904   7500686000   17.1
6032372  1000  2035018904   7700232000   55.8
6032373  1000  2035018904   1700973003  250.0

In [99]:
shifted_df[shifted_df.order_id == 2035018904 ]      #check up

         city  secondaries  price    order_id
3717867  1000   7500686000   17.1  2035018904
3717868  1000   7700232000   55.8  2035018904

In [100]:
shifted_df = shifted_df[['city', 'order_id', 'secondaries', 'price']]

In [101]:
shifted_df.head()

   city    order_id  secondaries  price
0  1000  1008984447    700831000   18.2
1  1000  1008992198   8700579001   17.5
2  1000  1009641513   3700017000   98.8
3  1000  1009650752   3300030000   39.0
4  1000  1009678287   2100101000    4.0

In [102]:
result = anchors.merge(shifted_df, how = 'left', on = 'order_id')\
                      .rename(columns = {'city_x':'city','price_x':'price_anchor', 'price_y':'price_secondary' })\
                      .drop('city_y', axis = 1)\
                      .fillna(0)\
                  
result.head()

   city    order_id      anchor  price_anchor   secondaries  price_secondary
0  1000  1008984447   800134000          19.2  7.008310e+08             18.2
1  1000  1008992198  8700605001          25.0  8.700579e+09             17.5
2  1000  1009641513  7200859000       27000.0  3.700017e+09             98.8
3  1000  1009650752  7200859000        5037.0  3.300030e+09             39.0
4  1000  1009678287  7200859000        4550.0  2.100101e+09              4.0

In [103]:
result['secondaries'] = result['secondaries'].astype(int)

In [104]:
result.tail(10)

         city    order_id  ...  secondaries  price_secondary
4782127  1000  2035018892  ...            0             0.00
4782128  2000  2035018894  ...            0             0.00
4782129  1000  2035018895  ...   1100286000            35.00
4782130  1000  2035018895  ...   2700759001           244.00
4782131  2000  2035018902  ...            0             0.00
4782132  1000  2035018904  ...   7500686000            17.10
4782133  1000  2035018904  ...   7700232000            55.80
4782134  1000  2035018952  ...            0             0.00
4782135  2000  2035018963  ...    900296001            23.14
4782136  2000  2035018963  ...    900297001            36.49

[10 rows x 6 columns]

In [105]:
general_set = result 
general_set.head()

   city    order_id      anchor  price_anchor  secondaries  price_secondary
0  1000  1008984447   800134000          19.2    700831000             18.2
1  1000  1008992198  8700605001          25.0   8700579001             17.5
2  1000  1009641513  7200859000       27000.0   3700017000             98.8
3  1000  1009650752  7200859000        5037.0   3300030000             39.0
4  1000  1009678287  7200859000        4550.0   2100101000              4.0

In [106]:
city_1000  = result[result.city == 1000] #for city 1000
city_1000.head()

   city    order_id      anchor  price_anchor  secondaries  price_secondary
0  1000  1008984447   800134000          19.2    700831000             18.2
1  1000  1008992198  8700605001          25.0   8700579001             17.5
2  1000  1009641513  7200859000       27000.0   3700017000             98.8
3  1000  1009650752  7200859000        5037.0   3300030000             39.0
4  1000  1009678287  7200859000        4550.0   2100101000              4.0

In [107]:
general_set.describe()

               city      order_id  ...   secondaries  price_secondary
count  4.782137e+06  4.782137e+06  ...  4.782137e+06     4.782137e+06
mean   1.630490e+03  2.033164e+09  ...  2.706496e+09     1.065366e+02
std    9.690316e+02  1.681343e+07  ...  2.536757e+09     2.862383e+02
min    1.000000e+03  1.008984e+09  ...  0.000000e+00     0.000000e+00
25%    1.000000e+03  2.032634e+09  ...  2.000480e+08     3.500000e+00
50%    1.000000e+03  2.033452e+09  ...  2.300594e+09     4.000000e+01
75%    2.000000e+03  2.034247e+09  ...  4.900087e+09     1.135200e+02
max    7.000000e+03  2.035019e+09  ...  9.900999e+09     1.062500e+05

[8 rows x 6 columns]